Revit 2027 API
FormulaEditingEventArgs.Apply Method
 Applies formula to the parameter
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Apply(
	string formula
)
Public Sub Apply (
	formula As String
)
public:
void Apply(
	String^ formula
)
member Apply :
        formula : string -> unit
Parameters
formula String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace